#### Terraform working directory 🏠: `demo/demo-account/network/security-group`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.security-group.module.sgs["test-galvin-02"].aws_security_group.this will be destroyed
  # (because module.security-group.module.sgs["test-galvin-02"] is not in configuration)
  - resource "aws_security_group" "this" {
      - arn                    = "arn:aws:ec2:ap-southeast-1:129980683758:security-group/sg-0aae5b690457fbee4" -> null
      - description            = "test-galvin-02" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "All protocols"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0aae5b690457fbee4" -> null
      - ingress                = [] -> null
      - name                   = "test-galvin-02" -> null
      - owner_id               = "129980683758" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "test-galvin-02"
        } -> null
      - tags_all               = {
          - "Name" = "test-galvin-02"
        } -> null
      - vpc_id                 = "vpc-0d06ae2c66a271e42" -> null
    }

  # module.security-group.module.sgs["test-galvin-03"].aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "test-galvin-03"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "test-galvin-03"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "test-galvin-03"
        }
      + tags_all               = {
          + "Name" = "test-galvin-03"
        }
      + vpc_id                 = "vpc-0d06ae2c66a271e42"
    }

  # module.security-group.module.sg_rules["test-galvin-02"].module.egress["allow-outbound"].aws_security_group_rule.cidr["0.0.0.0/0_-1_-1_-1"] will be destroyed
  # (because module.security-group.module.sg_rules["test-galvin-02"].module.egress["allow-outbound"] is not in configuration)
  - resource "aws_security_group_rule" "cidr" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "All protocols" -> null
      - from_port              = 0 -> null
      - id                     = "sgrule-1204186149" -> null
      - protocol               = "-1" -> null
      - security_group_id      = "sg-0aae5b690457fbee4" -> null
      - security_group_rule_id = "sgr-0f7e424552d8fe501" -> null
      - self                   = false -> null
      - to_port                = 0 -> null
      - type                   = "egress" -> null
    }

  # module.security-group.module.sg_rules["test-galvin-03"].module.egress["allow-outbound"].aws_security_group_rule.cidr["0.0.0.0/0_-1_-1_-1"] will be created
  + resource "aws_security_group_rule" "cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

Plan: 2 to add, 0 to change, 2 to destroy.

```

</details>

**Pusher**: @Galvin-wjw
**Action**: pull_request
